{
  "button": {
    "toggle_dark": "Oscuro",
    "toggle_light": "Claro",
    "pdf": "Versión PDF",
    "go_to_home": "Ir al inicio"
  },
  "basic": {
    "position": "Desarrollador Frontend"
  },
  "about_me": {
    "title": "Acerca de mí",
    "content": [
      "¡Hola! Mi nombre es José Olórtegui, un desarrollador frontend autodidacta de {{age}} años que vive en Paraguay. Con un poco más de {{yearsOfExperience}} años de experiencia, me especializo en tecnologías web frontend y me gusta cuidar la experiencia del usuario y aportar calidad a las cosas que construyo.",
      "En mi tiempo libre, la mayoría de las veces, me encontrarás jugando o creando algo que probablemente necesite para mejorar mi flujo de trabajo diario."
    ]
  },
  "work_experience": {
    "title": "Experiencia laboral",
    "positions": [
      {
        "title": "Fundación Paraguaya (Poverty Stoplight) — Desarrollador Frontend Senior",
        "duration": "Mar 2022 — Present",
        "tasks": [
          "Mantener principalmente una App Web y una App Móvil.",
          "Mejorar la experiencia del desarrollador."
        ]
      },
      {
        "title": "Independiente",
        "duration": "Feb 2020 — Mar 2022",
        "tasks": [
          "Trabajé con muchos proyectos en Wordpress y su ecosistema.",
          "Desarrollé una App Móvil para uno de los clubes sociales más grandes de mi país."
        ]
      },
      {
        "title": "Girolabs S.A — Coordinador Técnico",
        "duration": "Sep 2019 — Feb 2020",
        "tasks": [
          "Ayudar a resolver problemas con implementaciones que no permitían que el equipo progresara.",
          "Investigar e implementar nuevas tecnologías, metodologías o herramientas en el flujo de trabajo del equipo.",
          "Capacitar y asesorar a nuevos compañeros."
        ]
      },
      {
        "title": "Girolabs S.A — Manejador de Proyectos",
        "duration": "Jul 2019 — Sep 2019",
        "tasks": [
          "Manejar los tiempos de los proyectos para todos nuestros clientes.",
          "Encargado de gestionar la relación entre el cliente y el equipo."
        ]
      },
      {
        "title": "Girolabs S.A — Desarrollador Visual y Frontend, Diseñador UI",
        "duration": "Sep 2016 — Jul 2019",
        "tasks": [
          "Desarrollé muchos temas personalizados para Wordpress desde cero.",
          "Estaba a cargo de producir casi todo el trabajo de desarrollo para nuestros clientes."
        ]
      }
    ]
  },
  "skills_stack": {
    "title": "Habilidades y herramientas",
    "content": [
      "Experto con Typescript, Angular e Ionic. También con Wordpress.",
      "Actualmente investigando las profundidades de React y React Native",
      "Para estilizar me gusta usar Tailwind CSS, pero puedo cambiarme a cualquier librería CSS e incluso CSS plano.",
      "Hice uso de otros metaframeworks como Nuxt, Next.js y Gatsby.",
      "Web scrapping con Puppeteer.",
      "Cómodo con la terminal y Linux.",
      "Uso Neovim como mi editor de código.",
      "Capaz de hacer tareas DevOps.",
      "Proeficiente con Docker.",
      "Aprendiendo sobre bundlers con Vite.",
      "Cómodo usando programas de diseño como Figma y Photoshop.",
      "Experiencia con retoque fotográfico.",
      "Uso Notion para organizarme."
    ]
  },
  "open_source": {
    "title": "Código Abierto",
    "description": [
      "Me interesé en las herramientas que nos rodean a los desarrolladores, así que comencé a contribuir en proyectos de código abierto este año de forma más consistente.",
      "Mis propios proyectos:"
    ]
  },
  "languages": {
    "title": "Lenguas",
    "content": "Español (Nativo), Inglés (Intermedio Superior)"
  },
  "not_found": {
    "title": "No encontrado",
    "description": "No pudimos encontrar ninguna ruta para"
  }
}
