{
  "button": {
    "toggle_dark": "Oscuro",
    "toggle_light": "Claro",
    "pdf": "Versión PDF",
    "go_to_home": "Ir al inicio"
  },
  "basic": {
    "position": "Desarrollador Frontend"
  },
  "about_me": {
    "title": "Acerca de mí",
    "content": [
      "¡Hola! Mi nombre es José Olórtegui, un desarrollador frontend autodidacta de {{age}} años que vive en Paraguay. Con un poco más de {{yearsOfExperience}} años de experiencia, me especializo en tecnologías web frontend y me gusta cuidar la experiencia del usuario y aportar calidad a las cosas que construyo.",
      "En mi tiempo libre, la mayoría de las veces, me encontrarás jugando o creando algo que probablemente necesite para mejorar mi flujo de trabajo diario."
    ]
  },
  "work_experience": {
    "title": "Experiencia laboral",
    "positions": [
      {
        "title": "Fundación Paraguaya (Poverty Stoplight) — Desarrollador Frontend Senior",
        "duration": "Mar 2022 — Present",
        "tasks": [
          "Mantener principalmente una aplicación web y una aplicación móvil. Trabajé mucho con React, React Native y Material UI.",
          "Desarrollé una API que genera plantillas de correo electrónico bien diseñadas y con traducciones a otros lenguages. Hecho con Next.js, MJML y MDX.",
          "Promover e iniciar la migración a TypeScript y React Query.",
          "Dockerizé una aplicación enorme en Spring Boot/PostgreSQL para mejorar la ergonomía de la interfaz."
        ]
      },
      {
        "title": "Independiente",
        "duration": "Feb 2020 — Mar 2022",
        "tasks": [
          "Trabajé en muchos proyectos con Wordpress y su ecosistema.",
          "Desarrollar una aplicación móvil para uno de los clubes sociales más grandes de mi país. Hecho con Angular e Ionic.",
          "Aprendí mucho sobre RxJS y programación reactiva."
        ]
      },
      {
        "title": "Girolabs S.A — Coordinador Técnico",
        "duration": "Sep 2019 — Feb 2020",
        "tasks": [
          "Ayudar a resolver problemas con implementaciones que no permitían que el equipo progresara.",
          "Investigar e implementar nuevas tecnologías, metodologías o herramientas en el flujo de trabajo del equipo.",
          "Capacitar y asesorar a nuevos compañeros."
        ]
      },
      {
        "title": "Girolabs S.A — Manejador de Proyectos",
        "duration": "Jul 2019 — Sep 2019",
        "tasks": [
          "Manejar los tiempos de los proyectos para todos nuestros clientes.",
          "Encargado de gestionar la relación entre el cliente y el equipo."
        ]
      },
      {
        "title": "Girolabs S.A — Desarrollador Visual y Frontend, Diseñador UI",
        "duration": "Sep 2016 — Jul 2019",
        "tasks": [
          "Desarrollé muchos temas personalizados para Wordpress desde cero.",
          "Estuve a cargo de producir casi todo el trabajo de desarrollo para nuestros clientes.",
          "También a cargo del diseño de UI/UX para todos los proyectos."
        ]
      }
    ]
  },
  "skills_stack": {
    "title": "Habilidades y herramientas",
    "content": [
      "Experto con Typescript, Angular e Ionic. También con Wordpress.",
      "Actualmente profundizando en React y React Native.",
      "Para diseñar, me gusta usar Tailwind CSS, pero puedo cambiar a cualquier librería de CSS o incluso a CSS plano.",
      "Usado antes que otros metaframeworks como Next.js y Astro.",
      "Web scrapping con Puppeteer. Me encantaría probar a Playwright en un proyecto real.",
      "Cómodo con la terminal y Linux.",
      "Tuve que aprender el lenguaje de programación lua ya que uso Neovim como mi editor de código.",
      "Capaz de realizar tareas de DevOps.",
      "Competente con Docker.",
      "Aprendiendo mucho sobre empaquetadores con Vite.",
      "Cómodo usando software de diseño como Figma y Photoshop.",
      "Experiencia con el retoque fotográfico.",
      "Utilizo Notion y Todoist para organizarme."
    ]
  },
  "open_source": {
    "title": "Código Abierto",
    "description": [
      "Me interesé en las herramientas que nos rodean a los desarrolladores, así que comencé a contribuir en proyectos de código abierto este año de forma más consistente.",
      "Mis propios proyectos:"
    ]
  },
  "languages": {
    "title": "Lenguas",
    "content": "Español (Nativo), Inglés (Intermedio Superior)"
  },
  "not_found": {
    "title": "No encontrado",
    "description": "No pudimos encontrar ninguna ruta para"
  }
}
