{
  "site": {
    "title": "Resume"
  },
  "button": {
    "toggle_dark": "Dark",
    "toggle_light": "Light",
    "pdf": "PDF Version",
    "go_to_home": "Go to home",
    "repo": "Go to repo"
  },
  "basic": {
    "position": "Frontend Developer"
  },
  "about_me": {
    "title": "About me",
    "content": [
      "Hello! My name is José Olórtegui, a {{age}}-year-old, self-taught frontend developer hailing from Paraguay. With over {{yearsOfExperience}} years of hands-on experience, I have honed my expertise in frontend web technologies, focusing on delivering exceptional user experiences and ensuring the highest quality in everything I create."
    ]
  },
  "work_experience": {
    "title": "Work Experience",
    "positions": [
      {
        "title": "Fundación Paraguaya (Poverty Stoplight) — Senior Frontend Developer",
        "duration": "Mar 2022 — Present",
        "tasks": [
          "Maintained primarily a Web App and a Mobile App. Worked a lot with React, React Native, MUI and some Redux.",
          "Built an API that outputs well designed and localized email templates. Built with Next.js, MJML and MDX.",
          "Kickstarted the migration of the Web App project (80K LOC) to Typescript (now 50.4% migrated) and TanStack Query. Resulting in a huge reduction of bugs and far more confidence when refactoring.",
          "Containerized a huge Spring Boot/PostgreSQL application with Docker. Giving the frontend team a better development experience when integrating features with the backend.",
          "Migrated the whole Web App frontend project from Create React App (Webpack) to Vite. Reducing the development build time from 1 minute and 30 seconds to less than 1.2 seconds, saving us countless hours in the long run."
        ]
      },
      {
        "title": "Freelance",
        "duration": "Feb 2020 — Mar 2022",
        "tasks": [
          "Worked on a lot of projects with WordPress and its ecosystem. Especially using Elementor, WooCommerce and Crocoblock.",
          "Developed a Mobile App and a Web App (admin site for the Mobile App) for one of the largest social clubs in my country. Built with Angular and Ionic. Also learned a lot about RxJS.",
          "Worked with Docker and a lot of hosting providers to manage most WordPress instances."
        ]
      },
      {
        "title": "Girolabs — Technical Coordinator",
        "duration": "Sep 2019 — Feb 2020",
        "tasks": [
          "Helped out to solve issues with implementations that prevented the team from making progress.",
          "Researched and implemented new technologies, methodologies and tools into the team's workflow.",
          "Trained and advised new teammates and interns."
        ]
      },
      {
        "title": "Girolabs — Project Manager",
        "duration": "Jul 2019 — Sep 2019",
        "tasks": [
          "Managed the timings of the projects for all of our customers.",
          "Was in charge of managing the relationship between the client and the team."
        ]
      },
      {
        "title": "Girolabs — Visual & Frontend Developer, UI Designer",
        "duration": "Sep 2016 — Jul 2019",
        "tasks": [
          "Developed a lot of custom themes for WordPress from scratch.",
          "Worked in a couple of apps with Angular and Ionic.",
          "Was in charge of producing almost all of the development work for our customers.",
          "Also in charge of the UI/UX design for all of the projects."
        ]
      }
    ]
  },
  "skills_stack": {
    "title": "Skills & Stack",
    "content": [
      "Expert with Typescript, Angular and Ionic. Also with WordPress.",
      "Currently deep diving into React and React Native.",
      "For styling I like to use Tailwind CSS, but I can switch to any CSS library or even plain CSS.",
      "Strong knowledge about some metaframeworks like Next.js (v13) and Astro.",
      "Web scrapping with Puppeteer.",
      "Had to learn the Lua programming language since I use Neovim as my code editor.",
      "Lately been writing some Python for data migration/cleaning and scripting.",
      "Proeficient with Docker.",
      "Learning a lot about bundlers with Vite.",
      "Comfortable using design software such as Figma and Photoshop.",
      "Comfortable with the terminal and Linux environments.",
      "Capable of doing DevOps tasks.",
      "Comfortable using design software such as Figma and Photoshop.",
      "Experience with photo retouching.",
      "I use Notion and Todoist to organize myself."
    ]
  },
  "open_source": {
    "title": "Open Source",
    "description": [
      "I've got interested in the tooling that surround us developers so, I started contributing to open source since 2022 in a more consistent basis.",
      "My own projects:"
    ]
  },
  "languages": {
    "title": "Languages",
    "content": "Spanish (Native speaker), English (<0>C1 Advanced</0>)."
  },
  "not_found": {
    "title": "Not found",
    "description": "We couldn't find any routes that matches"
  }
}
